InformationRegisters/_РаботыЗаДень.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>_РаботыЗаДень</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Часы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧасыКлиенту</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗагруженоСRM</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоНачисление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбращения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ВидыОбращенийТехподдержки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСервисДеск</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Заявка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодСтроки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef._ИсполнениеЗадач</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/_РаботыЗаДень/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
    
    Если ОбменДанными.Загрузка тогда
        Возврат
    КонецЕсли; 
    
    Для Каждого стр из ЭтотОбъект Цикл 
        Если  стр.Заявка.Проверена  
            и не РольДоступна("_ИзменениеВыполненныхПроверенныхЗаявок") 
            и не РольДоступна("ПолныеПрава") 
            и не ДополнительныеСвойства.Свойство("ПропускатьПроверкуЗакрытойЗаявки") тогда
            ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Заявка %1 закрыта!!!",стр.Заявка),стр.Заявка,,,Отказ);
        КонецЕсли;
        стр.КодСтроки = ?( стр.КодСтроки = "",новый УникальныйИдентификатор, стр.КодСтроки);
        стр.ЧасыКлиенту  = ?(стр.ЧасыКлиенту = 0 ,?(стр.Задача.БизнесПроцесс.НеВыставлятьКонтрагенту,0,стр.ЧасыКлиенту),стр.ЧасыКлиенту);
        стр.ВидОбращения = ?(стр.ВидОбращения.Пустая(), стр.Задача.БизнесПроцесс.ВидОбращения, стр.ВидОбращения );
        стр.НомерСервисДеск = ?(стр.НомерСервисДеск = "", стр.Задача.БизнесПроцесс.НомерСервисДеск, стр.НомерСервисДеск );
        стр.Задание = ?(стр.Задание = "", стр.Задача.БизнесПроцесс.Наименование, стр.Задание );
    КонецЦикла;
    
    
    Если не Отказ  и не ДополнительныеСвойства.Свойство("НеЗаписыватьОписание") тогда
        мзадачи = ЭтотОбъект.Выгрузить(,"Задача");
        мзадачи.Свернуть("Задача");
        мас = Новый  Массив;
        мас.Добавить(мзадачи.ВыгрузитьКолонку("Задача"));
        ФоновыеЗадания.Выполнить("_ОбщийМодульСервер.ОбновитьОписанияЗадач", мас, новый УникальныйИдентификатор);
    КонецЕсли;
    //Если  не ДополнительныеСвойства.Свойство("ВнесениеЧлИзЗаявки") тогда
    //    
    //    Для Каждого стр из ЭтотОбъект Цикл 
    //    КонецЦикла;
    //    Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ДокументСтарый" ) тогда
    //        мас.Добавить(ЭтотОбъект.ДополнительныеСвойства.ДокументСтарый)
    //    КонецЕсли;
    //    мас.Добавить(ЭтотОбъект.Отбор.Заявка.Значение);
    //    
    //    ФоновыеЗадания.Выполнить("_ОбщийМодульСервер.ПеренестиЧлВЗаявку", мас, новый УникальныйИдентификатор);
    //КонецЕсли;
КонецПроцедуры
